app/views/visitors/index.html.erb

    	<% if current_user.admin? %>
    		<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
---
SELECT COUNT(*) FROM "users"