app/views/pages/home.html.erb

SELECT COUNT(*) FROM "users"
---
    	<% if current_user.admin? %>
    		<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>